---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillNoThicknessCeiling
source: html/f5c1f72a-852f-b090-a83e-871619fcd092.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillNoThicknessCeiling Property

Could not change type due to highlighted infilling element. 'Basic Ceiling' infills are only compatible with 'Basic Ceiling' hosts.

## Syntax (C#)
```csharp
public static FailureDefinitionId InfillNoThicknessCeiling { get; }
```